#ifndef _ASR_SCORE_H_
#define _ASR_SCORE_H_

/**************************************************************************
 * Copyright (C) 2023  Wanson
 **************************************************************************
 *
 * Description : asr_score.h
 * Author      : tang pei
 * Date        : 2026.07.14 13:17 
 *
 **************************************************************************/ 

/** 
*Features:
*Modify the threshold for identifying an instruction
*wake_score ： Instructions and threshold for wakeword grouping
*cmd_score  ： Instructions and threshold for command group
*
*1、When initializing the program, call the following API
*   extern int wanson_threshold_update(const void* custom_wake_ptr, unsigned short custom_wake_size,const void* custom_cmd_ptr, unsigned short custom_cmd_size);
*   if (wanson_threshold_update(&wake_score, sizeof(wake_score), &cmd_score, sizeof(cmd_score)) < 0) {
*       printf("wanson_threshold_update Failed!");
*   }
*
*2、Declare the function "void wanson_score_display_set(unsigned char value);"
*   And after the voice initialization is completed, call "wanson_score_display_set(1);" 
*   to display the score of the current voice recognition result.
*
*3、When the score of the voice recognition result is greater than the recognition command score predefined in "asr_score.h", it indicates a successful recognition. 
*   The function "int Wanson_ASR_Recog(short* buf, int buf_len, const char** text, float* score);" will return the recognition result and save it in "text".
**/ 
  
  
#define ASR_CMD_LEN              31 //与 V4 引擎(libmodel.a)的条目步长一致：int+char[31]

typedef struct { 
    int score; 
    char cmd[ASR_CMD_LEN];
}asr_score_t;

const asr_score_t wake_score[] = {
	{-63300,"接听电话"}, 
	{-63300,"挂断电话"}, 
	{-63300,"回拨电话"}, 
	{-63300,"拒接电话"}, 
	{-63300,"你好助手"}, 
	{-63300,"打开助手"}, 
	{-63300,"小金再见"},  
	{-63300,"小金小金"}, 
	{-63300,"你好小金"}, 
	};

const asr_score_t cmd_score[] = {	
	{-26900, "接听电话"}, 
	{-26900, "挂断电话"}, 
	{-26900, "回拨电话"}, 
	{-26900, "拒接电话"}, 
	{-26900, "你好助手"}, 
	{-26900, "打开助手"}, 
	{-26900, "小金再见"},  
	{-26900, "小金小金"}, 
	{-26900, "你好小金"}, 
	{-26900, "接听电话"}, 
	{-26900, "挂断电话"}, 
	{-26900, "停止播报"}, 
	{-26900, "上一首"}, 
	{-26900, "下一首"}, 
	{-26900, "换一首"}, 
	{-26900, "暂停播放"}, 
	{-26900, "暂停音乐"}, 
	{-26900, "停止播放"}, 
	{-26900, "继续播放"}, 
	{-26900, "单曲循环"}, 
	{-26900, "顺序播放"}, 
	{-26900, "随机播放"}, 
	{-26900, "上一台"}, 
	{-26900, "下一台"}, 
	{-26900, "打开调频"}, 
	{-26900, "打开调幅"}, 
	{-26900, "打开收音机"}, 
	{-26900, "关闭收音机"}, 
	{-26900, "打开音乐"}, 
	{-26900, "关闭音乐"}, 
	{-26900, "打开视频"}, 
	{-26900, "关闭视频"}, 
	{-26900, "打开图片"}, 
	{-26900, "关闭图片"}, 
	{-26900, "打开音效"}, 
	{-26900, "关闭音效"}, 
	{-26900, "打开用户指南"}, 
	{-26900, "关闭用户指南"}, 
	{-26900, "打开手机互联"}, 
	{-26900, "关闭手机互联"}, 
	{-26900, "打开监控"}, 
	{-26900, "关闭监控"}, 
	{-26900, "打开虚拟开关"}, 
	{-26900, "关闭虚拟开关"}, 
	{-26900, "打开车辆设置"}, 
	{-26900, "关闭车辆设置"}, 
	{-26900, "打开蓝牙"}, 
	{-26900, "关闭蓝牙"}, 
	{-26900, "关闭屏幕"}, 
	{-26900, "返回桌面"}, 
	{-26900, "调高屏幕亮度"}, 
	{-26900, "调低屏幕亮度"}, 
	{-26900, "最大屏幕亮度"}, 
	{-26900, "最小屏幕亮度"}, 
	{-26900, "调高仪表亮度"}, 
	{-26900, "调低仪表亮度"}, 
	{-26900, "最大仪表亮度"}, 
	{-26900, "最小仪表亮度"}, 
	{-26900, "打开白色主题"}, 
	{-26900, "打开黑色主题"}, 
	{-26900, "关闭声音"}, 
	{-26900, "打开声音"}, 
	{-26900, "增大音量"}, 
	{-26900, "减小音量"}, 
	{-26900, "最大音量"}, 
	{-26900, "最小音量"}, 
	{-26900, "打开空调"}, 
	{-26900, "关闭空调"}, 
	{-26900, "调高温度"}, 
	{-26900, "调低温度"}, 
	{-26900, "最高温度"}, 
	{-26900, "最低温度"}, 
	{-26900, "制冷模式"}, 
	{-26900, "加热模式"}, 
	{-26900, "内循环"}, 
	{-26900, "外循环"}, 
	{-26900, "调高风速"}, 
	{-26900, "调低风速"}, 
	{-26900, "最大风速"}, 
	{-26900, "最小风速"}, 
	{-26900, "打开新风"}, 
	{-26900, "关闭新风"}, 
	{-26900, "打开净化"}, 
	{-26900, "关闭净化"}, 
	{-26900, "打开司机区暖风"}, 
	{-26900, "打开乘客区暖风"}, 
	{-26900, "暖风高速"}, 
	{-26900, "暖风低速"}, 
	{-26900, "打开电加热器"}, 
	{-26900, "关闭电加热器"}, 
	{-26900, "打开柴油加热器"}, 
	{-26900, "关闭柴油加热器"}, 
	{-26900, "打开氛围灯"}, 
	{-26900, "关闭氛围灯"}, 
	{-26900, "打开导游阅读灯"}, 
	{-26900, "关闭导游阅读灯"}, 
	{-26900, "打开乘客阅读灯"}, 
	{-26900, "关闭乘客阅读灯"}, 
	{-26900, "打开灯光秀"}, 
	{-26900, "关闭灯光秀"}, 
	{-26900, "打开 a e b s"}, 
	{-26900, "关闭 a e b s"}, 
	{-26900, "打开 e s c"}, 
	{-26900, "关闭 e s c"}, 
	{-26900, "打开前挡玻璃加热"}, 
	{-26900, "关闭前挡玻璃加热"}, 
	{-26900, "打开路肩灯"}, 
	{-26900, "关闭路肩灯"}, 
	{-26900, "打开后雾灯"}, 
	{-26900, "关闭后雾灯"}, 
	{-26900, "打开前雾灯"}, 
	{-26900, "关闭前雾灯"}, 
	{-26900, "打开自动大灯"}, 
	{-26900, "关闭自动大灯"}, 
	{-26900, "打开司机顶灯"}, 
	{-26900, "关闭司机顶灯"}, 
	{-26900, "打开过道灯"}, 
	{-26900, "关闭过道灯"}, 
	{-26900, "打开车外氛围灯"}, 
	{-26900, "关闭车外氛围灯"}, 
	{-26900, "打开前面罩氛围灯"}, 
	{-26900, "关闭前面罩氛围灯"}, 
	{-26900, "打开路牌"}, 
	{-26900, "关闭路牌"}, 
	{-26900, "打开安全带报警"}, 
	{-26900, "关闭安全带报警"}, 
	{-26900, "打开智能排水加热"}, 
	{-26900, "关闭智能排水加热"}, 
	{-26900, "打开前 t v"}, 
	{-26900, "关闭前 t v"}, 
	{-26900, "打开中 t v"}, 
	{-26900, "关闭中 t v"}, 
	{-26900, "打开自动宣传视频"}, 
	{-26900, "关闭自动宣传视频"}, 
	{-26900, "打开前挡风扇"}, 
	{-26900, "关闭前挡风扇"}, 
	{-26900, "打开化冰"}, 
	{-26900, "关闭化冰"}, 
	{-26900, "打开自动雨刮"}, 
	{-26900, "关闭自动雨刮"}, 
	{-26900, "打开行李舱灯"}, 
	{-26900, "关闭行李舱灯"}, 
	{-26900, "打开鼓风机"}, 
	{-26900, "关闭鼓风机"}, 
	{-26900, "鼓风机高速档"}, 
	{-26900, "鼓风机低速档"}, 
	{-26900, "打开窗户加热"}, 
	{-26900, "关闭窗户加热"}, 
	{-26900, "打开司机风扇"}, 
	{-26900, "关闭司机风扇"}, 
};

#endif
